ams/src/DataProcessors/_ПрайсЛист/_ПрайсЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>_ПрайсЛист</name>
</mdclass:DataProcessor>

ams/src/Enums/AMS_Права/AMS_Права.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_Права</name>
  <enumValues>
    <name>СозданиеДоговораПоставки</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпецификацийВДокументеПроизводствоЗаСмену</name>
  </enumValues>
  <enumValues>
    <name>ПроведениеРеализацииБезОграничений</name>
  </enumValues>
  <enumValues>
    <name>Продукция_ПроизводствоПередача</name>
    <comment>Полный доступ к документу &quot;Производство за смену&quot;</comment>
  </enumValues>
  <enumValues>
    <name>Продукция_ПередачаНаСклад</name>
    <comment>Документ &quot;Производство за смену&quot;: ввод произведенного и передеча на склад</comment>
  </enumValues>
  <enumValues>
    <name>РазрешитьИзменятьЦены</name>
  </enumValues>
  <enumValues>
    <name>Устанавливать_MIN_MAX_Запасы</name>
  </enumValues>
  <enumValues>
    <name>УтверждатьПланПроизводства</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДоговораЗаРуководителя</name>
  </enumValues>
</mdclass:Enum>

ams/src/Enums/_ТипыВидовЦен/_ТипыВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_ТипыВидовЦен</name>
  <enumValues>
    <name>БытоваяХимия</name>
  </enumValues>
  <enumValues>
    <name>МЕГА</name>
  </enumValues>
  <enumValues>
    <name>Специальная</name>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/УстановкаЦенНоменклатуры/УстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦенНоменклатуры</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ПорчаТоваров</basedOn>
  <basedOn>Document.СборкаТоваров</basedOn>
  <basedOn>Document.ПрочееОприходованиеТоваров</basedOn>
  <basedOn>Document.ИзменениеАссортимента</basedOn>
  <basedOn>Document.ПриемкаТоваровНаХранение</basedOn>
  <basedOn>Document.ВводОстатков</basedOn>
  <registerRecords>InformationRegister.ЦеныНоменклатуры25</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.ИзменениеАссортимента</types>
      <types>DocumentRef.ПорчаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыУстановокЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзмененаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары2_5</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаЦО</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияЦО</name>
      <type>
        <types>CatalogRef.СерииНоменклатурыДляЦенообразования</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаЦО</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИзмененаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЦен</name>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиКомпоновкиДанных</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Catalogs/AMS_Константы/AMS_Константы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_Константы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникВидыЦен</name>
      <description>Виды цен</description>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Справочник партнеры</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.СегментыПартнеров</types>
      <types>CatalogRef.ВидыЦен</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
</mdclass:Catalog>

ams/src/Catalogs/AMS_Продукция/AMS_Продукция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AMS_Продукция</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Маркер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварныйЗнак</name>
      <type>
        <types>EnumRef.AMS_ТоварныйЗнак</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прайс</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>В2В</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЧестныйЗнак</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КфцРРЦ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ams/src/DataProcessors/_ПрайсЛист/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВариантПрайса = 1;
	ДатаЦены      = ТекущаяДатаСеанса();
	ДатаЦенПрайса = ТекущаяДатаСеанса();
	
	ЗаполнитьТаблицыВидовЦен();
	
	ПериодОтчетаПоИсторииЦен.Вариант       = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПериодОтчетаПоИсторииЦен.ДатаНачала    = ДобавитьМесяц(ДатаЦенПрайса, -12);
	ПериодОтчетаПоИсторииЦен.ДатаОкончания = ДатаЦенПрайса; 
	
	БезОграничений = AMS_ВызовСервера.ЕстьПравоАМС(Перечисления.AMS_Права.ПроведениеРеализацииБезОграничений);
	
	Элементы.СтраницаУстановкаЦен.Видимость = AMS_ВызовСервера.ЭтоKhors() Или БезОграничений;
	Элементы.СтраницаДокументы.Видимость = AMS_ВызовСервера.ЭтоKhors() Или БезОграничений;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаСтраницаПрайсы();
	ПоказатьЦены();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаПрайс Тогда 
//		ЗаполнитьСписокВыбораСкидок();
		ПоказатьПрайс();
	
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаЦены Тогда 
		ПоказатьЦены();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаИсторияЦены Тогда 
		ПоказатьИсториюЦены();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаУстановкаЦен Тогда
		НастройкаДействий();
		ПоказатьТовары();
		
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПечать Тогда 
		НастройкаСтраницаПрайсы();
	КонецЕсли;
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовСтраницаПечать

&НаКлиенте
Процедура ДатаПрайсаУстановленнаяПриИзменении(Элемент)
	УстановитьЗначениеКонстанты("_ДатаПрайса",ДатаПрайсаУстановленная);
	НастройкаСтраницаПрайсы();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПрайсаУстановленнаяМЕГАПриИзменении(Элемент)
	УстановитьЗначениеКонстанты("_ДатаПрайсаМЕГА",ДатаПрайсаУстановленнаяМЕГА);
	НастройкаСтраницаПрайсы();
КонецПроцедуры

&НаКлиенте
Процедура ФлагПроизвольнойДатыПрайсаПриИзменении(Элемент)
	НастройкаСтраницаПрайсы();
КонецПроцедуры

&НаКлиенте
Процедура ВариантПрайсаПриИзменении(Элемент)
	НастройкаСтраницаПрайсы();
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПрайсаПриИзменении(Элемент)
	СоглашениеПрайса = ПолучитьПоследнееСоглашение(ПартнерПрайса);
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеПрайсаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = ПартнерПрайса;
	ПараметрыВыбораСоглашения.Документ                    = СоглашениеПрайса;
	ПараметрыВыбораСоглашения.ДатаДокумента               = ОбщегоНазначенияКлиент.ДатаСеанса();
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницаПрайс

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	ПоказатьПрайс();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЦеныПриИзменении(Элемент)
	ПоказатьПрайс();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницаЦены

&НаКлиенте
Процедура ДатаЦенПрайсаПриИзменении(Элемент)
	ПоказатьЦены();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницаИстория

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	ПоказатьИсториюЦены();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПоказатьИсториюЦены();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницаУстановкаЦенНоменклатуры

&НаКлиенте
Процедура ВидЦеныБазоваяПриИзменении(Элемент)
	ПоказатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЦеныБазовойПриИзменении(Элемент)
	ПоказатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныНоваяПриИзменении(Элемент)
	ПоказатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЦеныНоваяПриИзменении(Элемент)
	ПоказатьТовары();
	ПоказатьКомментарий();
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	НастройкаДействий();
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыЦенБытХим

&НаКлиенте
Процедура ВидыЦенБытХимМеткаПриИзменении(Элемент)
	ПоказатьЦены();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыЦенМЕГА

&НаКлиенте
Процедура ВидыЦенМЕГАМеткаПриИзменении(Элемент)
	ПоказатьЦены();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыЦенСпец

&НаКлиенте
Процедура ВидыЦенСпецМеткаПриИзменении(Элемент)
	ПоказатьЦены();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьПрайса(Команда)
	Прайс.ПолеСлева               = 5;
	Прайс.ПолеСправа              = 5;
	Прайс.РазмерКолонтитулаСверху = 0;
	Прайс.РазмерКолонтитулаСнизу  = 0;
	Прайс.АвтоМасштаб             = Истина;
	Прайс.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;

	Массив = Новый Массив;
	Массив.Добавить(Скидка); 

	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка._ПрайсЛист", "Прайс", Массив, Неопределено,
	Новый Структура("ТабличныйДокумент", Прайс));
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПоказатьЦены();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоЦенам(Команда)
	ОткрытьФорму("Отчет._ЦеныНоменклатуры.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИсториюЦены(Команда)
	ПоказатьИсториюЦены();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	ВыполнитьДействиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНовыеЦены(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Будет выполнено изменение цены ""%1"" на дату %2 Продолжить?'"), 
		ВидЦеныНовая, Формат(ДатаЦеныНовая,"ДЛФ=ДД"));
		
	ПоказатьВопрос(Оповещение,ТекстВопроса,Режим);
КонецПроцедуры

&НаКлиенте
Процедура ПрайсыДляКлиентов(Команда)
	МассивОбъектов  = ПолучитьМассивОбъектов();
	ПараметрыПечати = ПолучитьПараметры(1);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи","ПрайсЛист",МассивОбъектов,Неопределено,ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПрайсыТехнические(Команда)
	МассивОбъектов  = ПолучитьМассивОбъектов();
	ПараметрыПечати = ПолучитьПараметры(2);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи","ПрайсЛист",МассивОбъектов,Неопределено,ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ПрайсыТехническиеКартинка(Команда)
	МассивОбъектов  = ПолучитьМассивОбъектов();
	ПараметрыПечати = ПолучитьПараметры(3);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Обработка.AMS_Продажи","ПрайсЛист",МассивОбъектов,Неопределено,ПараметрыПечати);
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВExcel(Команда)
	Парам = ПолучитьПараметры(1);
	
	ИмяФайла = "Прайс_АМС_" + Формат(Парам.Период,"ДЛФ=Д");
	Если ВариантПрайса = 1 Тогда
		ИмяФайла = ИмяФайла + "_" + ПартнерПрайса;
	КонецЕсли;

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок          = "Выберите каталог для сохранения ЗАКАЗА";
	Диалог.Фильтр             = "Файлы Excel (*.xlsx;*.xls)|*.xlsx;*.xls|";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.ПолноеИмяФайла     = ИмяФайла;
	
	Если Диалог.Выбрать() Тогда
		Состояние("Создание файла EXCEL.");
		
		ТабДок = ПолучитьТабДокПрайса(Парам);
		
		ТабДок.Записать(Диалог.ПолноеИмяФайла,ТипФайлаТабличногоДокумента.XLSX);
		
		Состояние();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПоказатьПрайс()
	ЕстьСкидка  = ЗначениеЗаполнено(Скидка);
	НомерСтроки = 0;
	
	Рез = ПолучитьДанныеПрайса();

	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Прайс");
	
	ОблЛоготип             = Макет.ПолучитьОбласть("Логотип");
	ОблСкидкаКлиента       = Макет.ПолучитьОбласть("СкидкаКлиента");
	ОблТипПродукции        = Макет.ПолучитьОбласть("ТипПродукции");
	ОблНазначениеПродукции = Макет.ПолучитьОбласть("НазначениеПродукции");
	ОблТоварныйЗнак        = Макет.ПолучитьОбласть("ТоварныйЗнак");
	ОблПодвал              = Макет.ПолучитьОбласть("Подвал");

	Если ЕстьСкидка Тогда
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблТовар = Макет.ПолучитьОбласть("Товар");
	Иначе
		ОблШапка = Макет.ПолучитьОбласть("Шапка1");
		ОблТовар = Макет.ПолучитьОбласть("Товар1");
	КонецЕсли;

	Прайс.Очистить();

	ОблЛоготип.Параметры.Срок = "Действителен с " + Формат(ДатаПрайсаУстановленная, "ДЛФ=ДД");
	Прайс.Вывести(ОблЛоготип);
	
	Если ЕстьСкидка Тогда
		ОблСкидкаКлиента.Параметры.СкидкаКлиента = "ПЕРСОНАЛЬНАЯ СКИДКА: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Скидка, "ЗначениеСкидкиНаценки") + " %";
		Прайс.Вывести(ОблСкидкаКлиента);
	КонецЕсли;

	Прайс.Вывести(ОблШапка);
	
	Выб1 = Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выб1.Следующий() Цикл
		ОблТипПродукции.Параметры.Заполнить(Выб1);
		Прайс.Вывести(ОблТипПродукции);
	
		Выб2 = Выб1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Выб2.Следующий() Цикл
			ОблНазначениеПродукции.Параметры.Заполнить(Выб2);
			Прайс.Вывести(ОблНазначениеПродукции);
	
			Выб3 = Выб2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выб3.Следующий() Цикл
				ОблТоварныйЗнак.Параметры.Заполнить(Выб3);
				Прайс.Вывести(ОблТоварныйЗнак);
	
				Выб4 = Выб3.Выбрать();
				Пока Выб4.Следующий() Цикл
					НомерСтроки = НомерСтроки + 1;
					
					ОблТовар.Параметры.Заполнить(Выб4);
					
					ОблТовар.Параметры.НомерСтроки = НомерСтроки;
					
					Прайс.Вывести(ОблТовар);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Прайс.Вывести(ОблПодвал);
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПрайса()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены); 
	Запрос.УстановитьПараметр("ВидЦены", Справочники.AMS_Константы["ВидыЦенБазовая"].Значение);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	д.Родитель КАК ТипПродукции,
	|	д.Ссылка КАК НазначениеПродукции,
	|	т.ТоварныйЗнак КАК ТоварныйЗнак,
	|	т.Номенклатура КАК Номенклатура,
	|	ном.НаименованиеПолное КАК НаименованиеПолное,
	|	т.Маркер КАК Маркер,
	|	ном.Артикул КАК Артикул,
	|	т.Объем КАК Объем,
	|	ном.КоэффициентЕдиницыДляОтчетов КАК КолНаМесто,
	|	д.Родитель.Наименование КАК ТипНаименование,
	|	д.Наименование КАК НазначениеНаименование,
	|	т.ТоварныйЗнак.Порядок КАК ТоварныйЗнакПорядок,
	|	т.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ Продукция
	|ИЗ
	|	Справочник.AMS_Продукция КАК д
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.AMS_Продукция.Товары КАК т
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ном
	|			ПО т.Номенклатура = ном.Ссылка
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	НЕ д.ЭтоГруппа
	|	И т.Прайс
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.ВидЦены КАК ВидЦены,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Период КАК Период
	|ПОМЕСТИТЬ ДатыЦен
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК т
	|ГДЕ
	|	т.ВидЦены = &ВидЦены
	|	И т.Период <= &ДатаЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Цены.Номенклатура КАК Номенклатура,
	|	Цены.Цена КАК Цена
	|ПОМЕСТИТЬ ЦенаБазовая
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК Цены
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыЦен КАК ДатыЦен
	|		ПО Цены.Номенклатура = ДатыЦен.Номенклатура
	|		И Цены.Период = ДатыЦен.Период
	|		И Цены.ВидЦены = ДатыЦен.ВидЦены
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Продукция.ТипПродукции КАК ТипПродукции,
	|	Продукция.НазначениеПродукции КАК НазначениеПродукции,
	|	Продукция.ТоварныйЗнак КАК ТоварныйЗнак,
	|	Продукция.Номенклатура КАК Номенклатура,
	|	Продукция.НаименованиеПолное КАК НаименованиеПолное,
	|	Продукция.Маркер КАК Маркер,
	|	Продукция.Артикул КАК Артикул,
	|	Продукция.Объем КАК Объем,
	|	Продукция.КолНаМесто КАК КолНаМесто,
	|	ЦенаБазовая.Цена КАК ЦенаБезНДС,
	|	ЦенаБазовая.Цена * 1.2 КАК ЦенаСНДС,
	|	Продукция.ТипНаименование КАК ТипНаименование,
	|	Продукция.НазначениеНаименование КАК НазначениеНаименование,
	|	Продукция.ТоварныйЗнакПорядок КАК ТоварныйЗнакПорядок,
	|	Продукция.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Продукция КАК Продукция
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаБазовая КАК ЦенаБазовая
	|		ПО Продукция.Номенклатура = ЦенаБазовая.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипНаименование,
	|	НазначениеНаименование,
	|	ТоварныйЗнакПорядок,
	|	НомерСтроки
	|ИТОГИ
	|ПО
	|	ТипПродукции,
	|	НазначениеПродукции,
	|	ТоварныйЗнак";

	Возврат Запрос.Выполнить();
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицыВидовЦен()
	БытХим = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._ТипыВидовЦен.БытоваяХимия");
	МЕГА   = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._ТипыВидовЦен.МЕГА");
	Спец   = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление._ТипыВидовЦен.Специальная");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыЦен.Ссылка КАК ВидЦены,
		|	ВидыЦен._ТипВидаЦены КАК ТипВидаЦены
		|ИЗ
		|	Справочник.ВидыЦен КАК ВидыЦен
		|ГДЕ
		|	НЕ ВидыЦен._ТипВидаЦены = ЗНАЧЕНИЕ(Перечисление._ТипыВидовЦен.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыЦен.Наименование";
	
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();
	
	Пока Выб.Следующий() Цикл
		Если Выб.ТипВидаЦены = БытХим Тогда
			Стр = ВидыЦенБытХим.Добавить();
			Стр.ВидЦены = Выб.ВидЦены;
		
		ИначеЕсли Выб.ТипВидаЦены = МЕГА Тогда
			Стр = ВидыЦенМЕГА.Добавить();
			Стр.ВидЦены = Выб.ВидЦены;
		
		ИначеЕсли Выб.ТипВидаЦены = Спец Тогда
			Стр = ВидыЦенСпец.Добавить();
			Стр.ВидЦены = Выб.ВидЦены;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НастроитьПараметры()
	ВидыЦен.Очистить();
	
	ЕстьВидЦенБытХим = Ложь;
	ЕстьВидЦенМЕГА = Ложь;
	ЕстьСпецЦены = Ложь;
	
	Для Каждого Стр Из ВидыЦенБытХим Цикл
		Если Стр.Метка Тогда
			ВидыЦен.Добавить(Стр.ВидЦены);
			ЕстьВидЦенБытХим = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ВидыЦенМЕГА Цикл
		Если Стр.Метка Тогда
			ВидыЦен.Добавить(Стр.ВидЦены);
			ЕстьВидЦенМЕГА = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Стр Из ВидыЦенСпец Цикл
		Если Стр.Метка Тогда
			ВидыЦен.Добавить(Стр.ВидЦены);
			ЕстьСпецЦены = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПоказатьЦены()
	НастроитьПараметры();
	
	Цены.Очистить();
	
	СКД = РеквизитФормыВЗначение("Объект").ПолучитьМакет("скдЦены");
	
	Настройки = СКД.НастройкиПоУмолчанию;
	
	
	Парам = Новый Структура;
	Парам.Вставить("Период",КонецДня(ДатаЦенПрайса));
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"ВидЦены",ВидыЦен,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
	Если ЕстьВидЦенБытХим И ЕстьВидЦенМЕГА Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"ЭтоМЕГА",,,,Ложь);
		
	Иначе 
		Если ЕстьВидЦенБытХим Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"ЭтоМЕГА",Ложь,ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
		Если ЕстьВидЦенМЕГА Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"ЭтоМЕГА",Истина,ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
	КонецЕсли;	
	
	Если ЕстьСпецЦены И Не (ЕстьВидЦенБытХим Или ЕстьВидЦенМЕГА) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"Цена",0,ВидСравненияКомпоновкиДанных.Больше,,Истина);
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"Цена",,,,Ложь);
	КонецЕсли;	
	
	мср.ПолучитьДанныеНаОснованииСКД(СКД,Цены,Настройки,Парам);
КонецПроцедуры

&НаСервере
Процедура ПоказатьИсториюЦены()
	ЦеныИстория.Очистить();
	
	СКД = РеквизитФормыВЗначение("Объект").ПолучитьМакет("скдИсторияЦены");
	
	Настройки = СКД.НастройкиПоУмолчанию;
	
	Парам = Новый Структура;
	Парам.Вставить("Период",ПериодОтчетаПоИсторииЦен);
	Парам.Вставить("ВидЦены",ВидЦены);
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"ВидЦены",ВидыЦен,ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
	Если ЕстьВидЦенБытХим И ЕстьВидЦенМЕГА Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"ЭтоМЕГА",,,,Ложь);
		
	Иначе 
		Если ЕстьВидЦенБытХим Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"ЭтоМЕГА",Ложь,ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
		Если ЕстьВидЦенМЕГА Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"ЭтоМЕГА",Истина,ВидСравненияКомпоновкиДанных.Равно,,Истина);
		КонецЕсли;
	КонецЕсли;	
	
	Если ЕстьСпецЦены И Не (ЕстьВидЦенБытХим Или ЕстьВидЦенМЕГА) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"Цена",0,ВидСравненияКомпоновкиДанных.Больше,,Истина);
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Настройки.Отбор,"Цена",,,,Ложь);
	КонецЕсли;	
	
	мср.ПолучитьДанныеНаОснованииСКД(СКД,ЦеныИстория,Настройки,Парам);
КонецПроцедуры

&НаСервере
Процедура ПоказатьТовары()
	Товары.Очистить();
	
	СКД = РеквизитФормыВЗначение("Объект").ПолучитьМакет("скдУстановкаЦен");
	
	Парам = Новый Структура;
	Парам.Вставить("ВидЦеныБазовая",ВидЦеныБазовая);
	Парам.Вставить("Период",КонецДня(ДатаЦеныБазовой));
	Парам.Вставить("ВидЦены",ВидЦеныНовая);
	Парам.Вставить("ДатаУстановки",КонецДня(ДатаЦеныНовая));

	Табл = РеквизитФормыВЗначение("Товары");
    мср.ПолучитьДанныеНаОснованииСКД(СКД,Табл,Неопределено,Парам);
	ЗначениеВРеквизитФормы(Табл,"Товары");
КонецПроцедуры

&НаСервере
Процедура ПоказатьКомментарий()
	Табл = ПолучитьТаблДокументовУстановкаЦенНоменклатуры(ДатаЦеныНовая);
	
	Комментарий = "";
	
	Если Табл.Количество() > 0 Тогда 
		Комментарий = Табл[0].Комментарий;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкаДействий()
	Элементы.Процент.Заголовок = ?(Действие = 2,"Цена (руб.)","Процент (%)");
	Элементы.Процент.Доступность = Не (Действие = 3);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеНаСервере()
	Если ДействиеОбласть = 0 Тогда
		Массив = Элементы.Товары.ВыделенныеСтроки;
		Для каждого Элемент Из Массив Цикл
			ВыполнитьДействиеВСтроке(Товары.НайтиПоИдентификатору(Элемент));
		КонецЦикла;
		
	Иначе
		Для каждого Стр Из Товары Цикл
			ВыполнитьДействиеВСтроке(Стр);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеВСтроке(Стр)
	Если Действие = 0 Тогда
		Стр.Цена = Стр.ЦенаБазовая * (100 + Процент) / 100;
		
	ИначеЕсли Действие = 1 Тогда
		Стр.Цена = Стр.ЦенаБазовая * (100 - Процент) / 100;
		
	ИначеЕсли Действие = 2 Тогда
		Стр.Цена = Процент;
		
	ИначеЕсли Действие = 3 Тогда
		Стр.Цена = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Да Тогда
        ЗаписатьИзмененияЦен();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияЦен()
	Табл = ПолучитьНовыеЦены();
	
	Если Табл.Количество() = 0 Тогда 
		ОбщегоНазначения.СообщитьПользователю("Новых цен не обнаружено.");
	КонецЕсли;
	
	ТабДок = ПолучитьТаблДокументовУстановкаЦенНоменклатуры(ДатаЦеныНовая);
	
	КолДок = ТабДок.Количество();
	
	Если КолДок > 0 Тогда 
		Док = ТабДок[0].Документ.ПолучитьОбъект();
	Иначе
		Док = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	КонецЕсли;
	
	Док.Дата = ДатаЦеныНовая; 
	Док.Ответственный = Пользователи.ТекущийПользователь(); 
	Док.Комментарий = Комментарий; 
	Док.Согласован = Истина; 
	Док.Статус = Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован; 
	
	Данные = ПолучитьДанныеПоЦенам(Табл,ДатаЦеныНовая,ВидЦеныНовая);

	РезТовары = Данные.Товары;
	РезВидыЦен = Данные.ВидыЦен;
	
	Табл = Док.Товары;
	Табл.Очистить();
	Выб = РезТовары.Выбрать();
	Пока Выб.Следующий() Цикл
		Стр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Выб);
	КонецЦикла;
	
	Табл = Док.ВидыЦен;
	Табл.Очистить();
	Выб = РезВидыЦен.Выбрать();
	Пока Выб.Следующий() Цикл
		Стр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,Выб);
	КонецЦикла;
	
	мср.ЗаписатьДокумент(Док,РежимЗаписиДокумента.Проведение); 
	
	ПоказатьТовары();
	
	Если КолДок > 1 Тогда
		Для Сч = 2 По КолДок Цикл
			Док = ТабДок[Сч-1].Документ.ПолучитьОбъект();
		    мср.УстановитьПометкуУдаленияДокументу(Док,Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыеЦены()
	Таб = РеквизитФормыВЗначение("Товары");
	
	Табл = Таб.СкопироватьКолонки("Номенклатура,Цена");
	
	Для каждого Стр Из Таб Цикл
		Если Стр.Цена = 0 Или Стр.Цена = Стр.ЦенаСтарая Тогда 
			Продолжить;
		КонецЕсли;
		
		НовСтр = Табл.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр,Стр);
	КонецЦикла;
	
	Возврат Табл;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТаблДокументовУстановкаЦенНоменклатуры(Дата)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	д.Номер КАК Номер,
	|	д.Дата КАК Дата,
	|	д.Ссылка КАК Документ,
	|	д.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК д
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	д.МоментВремени";
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоЦенам(Табл,Дата,ВидЦены)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены);
	Запрос.УстановитьПараметр("Табл",Табл);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	&Табл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ВидЦены КАК ВидЦены,
	|	Таб.Номенклатура КАК Номенклатура,
	|	Таб.Цена КАК Цена
	|ПОМЕСТИТЬ НовЦена
	|ИЗ
	|	Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.ВидЦены КАК ВидЦены,
	|	т.Номенклатура КАК Номенклатура,
	|	т.Цена КАК Цена
	|ПОМЕСТИТЬ СтарЦена
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.Товары КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовЦена.ВидЦены КАК ВидЦены,
	|	НовЦена.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВсеТовары
	|ИЗ
	|	НовЦена КАК НовЦена
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтарЦена.ВидЦены,
	|	СтарЦена.Номенклатура
	|ИЗ
	|	СтарЦена КАК СтарЦена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеТовары.ВидЦены КАК ВидЦены,
	|	ВсеТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	ВсеТовары КАК ВсеТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ НовВидыЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ СтарВидыЦен
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры.ВидыЦен КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НовВидыЦен.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВсеВидыЦен
	|ИЗ
	|	НовВидыЦен КАК НовВидыЦен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтарВидыЦен.ВидЦены
	|ИЗ
	|	СтарВидыЦен КАК СтарВидыЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеВидыЦен.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВидыЦен
	|ИЗ
	|	ВсеВидыЦен КАК ВсеВидыЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыЦен.ВидЦены КАК ВидЦены
	|ИЗ
	|	ВидыЦен КАК ВидыЦен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыЦен.ВидЦены.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.ВидЦены КАК ВидЦены,
	|	Товары.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА НовЦена.Цена ЕСТЬ NULL
	|			ТОГДА СтарЦена.Цена
	|		ИНАЧЕ НовЦена.Цена
	|	КОНЕЦ КАК Цена,
	|	ИСТИНА КАК ЦенаИзмененаВручную
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтарЦена КАК СтарЦена
	|		ПО Товары.ВидЦены = СтарЦена.ВидЦены
	|			И Товары.Номенклатура = СтарЦена.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НовЦена КАК НовЦена
	|		ПО Товары.ВидЦены = НовЦена.ВидЦены
	|			И Товары.Номенклатура = НовЦена.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Товары.ВидЦены.Наименование,
	|	Товары.Номенклатура.Наименование";
	
	Рез = Запрос.ВыполнитьПакет();
	
	Данные = Новый Структура;
	Данные.Вставить("ВидыЦен",Рез[9]);
	Данные.Вставить("Товары",Рез[10]);
	
	Возврат Данные;
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьЗначениеКонстанты(Константа,Значение)
	Константы[Константа].Установить(Значение);
КонецПроцедуры

&НаСервере
Процедура НастройкаСтраницаПрайсы()
	ДатаПрайсаУстановленная = Константы._ДатаПрайса.Получить();
	ДатаПрайсаУстановленнаяМЕГА = Константы._ДатаПрайсаМЕГА.Получить();
	
	ЗаполнитьСпискиВыбораВидовЦен();
	
	ЭтоСтаршийМенеджер = AMS_ВызовСервера.ДоступнаКонкретнаяРоль("_СтаршийМенеджер") Или AMS_ВызовСервера.ЭтоKhors();
	
	Элементы.ДатаПрайсаУстановленная.Доступность     = ЭтоСтаршийМенеджер;
	Элементы.ДатаПрайсаУстановленнаяМЕГА.Доступность = ЭтоСтаршийМенеджер;
	
	Элементы.ФлагПроизвольнойДатыПрайса.Видимость = ЭтоСтаршийМенеджер;
	Элементы.ДатаПрайсаПроизвольная.Видимость     = ФлагПроизвольнойДатыПрайса;
	
	Если ВариантПрайса = 1 или ВариантПрайса = 2 или ВариантПрайса = 3 или ВариантПрайса = 4 Тогда
		Элементы.СтраницыПрайса.Видимость = Истина;
		Элементы.СтраницыПрайса.ТекущаяСтраница = Элементы["СтраницаПрайса" + ВариантПрайса];
	Иначе
		Элементы.СтраницыПрайса.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбораВидовЦен()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Ссылка КАК ВидЦены,
	|	т.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВидыЦен КАК т
	|ГДЕ
	|	НЕ т.ЦенаВключаетНДС
	|	И т.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)";
	
	Таб = Запрос.Выполнить().Выгрузить();
	Таб.Сортировать("Наименование");
	
	МассивБытХим = Новый Массив;
	МассивМега   = Новый Массив;
	
	Для каждого Стр Из Таб Цикл
		Если СтрНайти(Стр.Наименование,"Плановая") > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрНайти(Стр.Наименование,"МЕГА") > 0 Тогда
			МассивМега.Добавить(Стр.ВидЦены);
		Иначе
			МассивБытХим.Добавить(Стр.ВидЦены);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ВидЦеныБытХим.СписокВыбора.ЗагрузитьЗначения(МассивБытХим);
	Элементы.ВидЦеныБытХим1.СписокВыбора.ЗагрузитьЗначения(МассивБытХим);
	
	Элементы.ВидЦеныМега.СписокВыбора.ЗагрузитьЗначения(МассивМега);
	Элементы.ВидЦеныМега1.СписокВыбора.ЗагрузитьЗначения(МассивМега);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнееСоглашение(ПартнерПрайса)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер",ПартнерПрайса);
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Соглашение КАК Соглашение
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	НЕ т.ПометкаУдаления
	|	И т.Партнер = &Партнер
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.МоментВремени УБЫВ";
	
	Рез = Запрос.Выполнить();
	
	Если Рез.Пустой() Тогда 
		Возврат Справочники.СоглашенияСКлиентами.ПустаяСсылка();
		
	Иначе 
		Выб = Рез.Выбрать();
		Выб.Следующий();
		
		Возврат Выб.Соглашение;
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ПолучитьПараметры(ТипПрайса)
	Парам = AMS_ВызовСервера.ПолучитьПараметрыДляПрайса(ТипПрайса,ВариантПрайса,СоглашениеПрайса,ВидЦеныБытХим,ВидЦеныМега);

	Если ФлагПроизвольнойДатыПрайса Тогда 
		Дата = ДатаПрайсаПроизвольная;

	Иначе
		Если ВариантПрайса = 1 Тогда
			Если ЗначениеЗаполнено(ВидЦеныМега) Тогда 
				Дата = ?(ДатаПрайсаУстановленная >= ДатаПрайсаУстановленнаяМЕГА,ДатаПрайсаУстановленная,ДатаПрайсаУстановленнаяМЕГА);
			Иначе
				Дата = ДатаПрайсаУстановленная;
			КонецЕсли;
				
		ИначеЕсли ВариантПрайса = 2 Тогда
			Если ЗначениеЗаполнено(ВидЦеныБытХим) И ЗначениеЗаполнено(ВидЦеныМега) Тогда 
				Дата = ?(ДатаПрайсаУстановленная >= ДатаПрайсаУстановленнаяМЕГА,ДатаПрайсаУстановленная,ДатаПрайсаУстановленнаяМЕГА);
				
			Иначе
				Если ЗначениеЗаполнено(ВидЦеныБытХим) Тогда 
					Дата = ДатаПрайсаУстановленная;
				ИначеЕсли ЗначениеЗаполнено(ВидЦеныМега) Тогда 
					Дата = ДатаПрайсаУстановленнаяМЕГА;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ВариантПрайса = 3 Или ВариантПрайса = 5 Или ВариантПрайса = 6 Тогда
			Дата = ДатаПрайсаУстановленная;
			
		ИначеЕсли ВариантПрайса = 4 Или ВариантПрайса = 7 Или ВариантПрайса = 8 Тогда
			Дата = ДатаПрайсаУстановленнаяМЕГА;
		КонецЕсли;
	КонецЕсли;
	
	Парам.Вставить("Организация",Организация);
	Парам.Вставить("Дата"       ,Дата);
	Парам.Вставить("Период"     ,?(ДатаЦенПрайса = '0001.01.01',Дата,ДатаЦенПрайса));
	
	Возврат Парам;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивОбъектов()
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	Возврат МассивОбъектов;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТабДокПрайса(Парам)
	Возврат Обработки.AMS_Продажи.СформироватьПрайсЛист(Парам);
КонецФункции

#КонецОбласти
